{
    "article_title": "Metformin reduces the competitive advantage of Dnmt3aR878H HSPCs",
    "metadata": {
        "doi": "https://doi.org/10.1038/s41586-025-08871-w",
        "authors": [
            "Mohsen Hosseini",
            "Veronique Voisin",
            "Ali Chegini",
            "Angelica Varesi",
            "Severine Cathelin",
            "Dhanoop Manikoth Ayyathan",
            "Alex C. H. Liu",
            "Yitong Yang",
            "Vivian Wang",
            "Abdula Maher",
            "Eric Grignano",
            "Julie A. Reisz",
            "Angelo D'Alessandro",
            "Kira Young",
            "Yiyan Wu",
            "Martina Fiumara",
            "Samuele Ferrari",
            "Luigi Naldini",
            "Federico Gaiti",
            "Shraddha Pai",
            "Grace Egan",
            "Aaron D. Schimmer",
            "Gary D. Bader",
            "John E. Dick",
            "Stephanie Z. Xie",
            "Jennifer J. Trowbridge",
            "Steven M. Chan"
        ]
    },
    "abstract": "Clonal haematopoiesis arises when a haematopoietic stem cell (HSC) acquires a mutation that confers a competitive advantage over wild-type HSCs, resulting in its clonal expansion. Individuals with clonal haematopoiesis are at increased risk of developing haematologic neoplasms and other age-related inflammatory illnesses (Ref: 1-4). Suppressing the expansion of mutant HSCs may prevent these outcomes; however, such interventions have not yet been identified. The most common clonal haematopoiesis driver mutations are in the DNMT3A gene, with arginine 882 (R882) being a mutation hotspot (Ref: 1-3,5-7). Here we show that mouse haematopoietic stem and progenitor cells (HSPCs) carrying the Dnmt3aR878H/+ mutation, equivalent to human DNMT3AR882H/+, have increased mitochondrial respiration compared with wild-type cells and are dependent on this metabolic reprogramming for their competitive advantage. Treatment with metformin, an anti-diabetic drug that inhibits mitochondrial respiration (Ref: 8), reduced the competitive advantage of Dnmt3aR878H/+ HSCs. Through a multi-omics approach, we found that metformin acts by enhancing methylation potential in Dnmt3aR878H/+ HSPCs and reversing the aberrant DNA CpG methylation and histone H3 K27 trimethylation profiles in these cells. Metformin also reduced the competitive advantage of human DNMT3AR882H HSPCs generated by prime editing. Our findings provide preclinical rationale for investigating metformin as a preventive intervention against DNMT3A R882 mutation-driven clonal haematopoiesis in humans.",
    "introduction": "Mutations in DNMT3A are the most common genetic alterations in clonal haematopoiesis and are found in between 50% and 60% of clonal haematopoiesis carriers (Ref: 1-3,5,6). DNMT3A encodes a de novo DNA methyltransferase that catalyses transfer of the methyl group from S-adenosylmethionine (SAM) to the C5 position of cytosines in DNA, resulting in 5-methylcytosine (5mC) and production of S-adenosylhomocysteine (SAH). DNMT3A mutations are classified into those that affect the mutational hotspot at R882 of the DNMT3A protein and those that affect other parts of the gene (non-R882 mutations) (Ref: 7,9). Although both types of mutations are predicted to reduce methyltransferase activity, DNMT3A R882 mutations appear to confer a significantly higher risk of progression to acute myeloid leukaemia (AML) compared with non-R882 DNMT3A mutations (Ref: 10,11). Thus, DNMT3A R882 mutations represent an important target for preventive intervention. The mutations that affect R882 are almost invariably missense alterations and heterozygous (Ref: 12,13). DNMT3A R882 mutations have been shown to both reduce the methyltransferase activity of the mutant protein and decrease the activity of the wild-type protein in a dominant-negative manner (Ref: 13,14). Consistent with these findings, the differentially methylated regions (DMRs) in human AML cells or peripheral blood cells with DNMT3A R882 mutations are predominantly hypomethylated compared with their wild-type counterparts (Ref: 13,15). The effect of DNMT3A mutations on cell fate decisions of HSCs has previously been studied using genetically modified mouse models. In the Dnmt3aR878H/+ mouse model, the mutant HSCs are expanded and have a competitive advantage over wild-type HSCs (Ref: 16), thus recapitulating a key functional change associated with the mutation in humans. Here we used this model to identify differences in dependencies between Dnmt3aR878H/+ and wild-type HSPCs with the goal of targeting such dependencies to selectively suppress the expansion of mutant HSCs.",
    "results": {
        "subsections": [
            {
                "title": "Increased OXPHOS in Dnmt3aR878H/+ HSPCS",
                "content": "Analysis of publicly available RNA-sequencing (RNA-seq) datasets from primary AML samples revealed an increase in the expression of genes involved in oxidative phosphorylation (OXPHOS) in DNMT3A R882-mutated patient samples, but not in non-R882DNMT3A-mutated samples, compared with DNMT3A wild-type samples (Extended Data Fig. 1a). To validate this finding in the context of clonal haematopoiesis, we analysed a previously published single-cell RNA-sequencing (scRNA-seq) dataset of CD34+-enriched HSPCs from individuals with clonal haematopoiesis (Ref: 17). Pseudobulk differential expression analysis also showed an increase in OXPHOS gene expression in DNMT3A R882-mutated cells relative to wild-type cells (Extended Data Fig. 1b). These findings led us to explore the potential for differences in mitochondrial function between Dnmt3aR878H/+ and Dnmt3a+/+ mouse HSPCs. We found that Dnmt3aR878H/+ lineage-negative, KIT-positive (LK) cells, which are enriched for HSPCs, possessed higher levels of basal and maximal oxygen consumption rates (OCRs) than Dnmt3a+/+ LK cells, as determined by extracellular flux analysis (Fig. 1a). These differences were also observed in unfractionated whole bone marrow (WBM) cells, albeit by a smaller magnitude (Extended Data Fig. 1c). Furthermore, the level of mitochondrial reactive oxygen species (ROS) and the ratio of mitochondrial transmembrane potential (Am) to mitochondrial mass were higher in mutant LK cells than in wild-type LK cells (Fig. 1b,c). Together, these findings indicate that the Dnmt3qR878H mutation causes metabolic reprogramming in HSPCs, resulting in upregulation of OXPHOS.",
                "figures": [
                    "Fig.1|Dnmt3aR878H/+ HSPCs are dependent on increased mitochondrial respiration. a, Basal (left) and maximal (middle) OCRs in LK HSPCs. Right, OCRs of LK cells at baseline and after treatment with the indicated drugs. n = 4 biologically independent samples for Dnmt3aR878H/+ and n = 6 for Dnmt3a+/+. Oligo A, oligomycin; R&A, antimycin A + rotenone b, MitoSOX fluorescence in LK HSPCs. n = 4 biologically independent samples each. c, Ratio of tetramethylrhodamine ethyl ester (TMRE) to MitoTracker Green (MTG) fluorescence in LK HSPCs. n = 4 biologically independent samples each. d, Basal OCR in LK HSPCs expressing shNT, or shRNA targeting Ndufv1 (shNdufv1) or Cox15 (shCox15). n = 3 biologically independent samples for each condition. e, Proportion of CD45.2+ and CD45.1+ cells transduced with the indicated shRNA vectors in a competition assay. n = 3 biologically independent samples each. f, Proportion of CD45.2+ and CD45.1 cells in a competition assay with or without metformin (Met). n = 3 biologically independent samples each. g, Proportion of CD45.2+ and CD45.1 cells in a competition assay with or without metformin. The CD45.2+ LK cells were transduced with an empty or NDI1-expressing lentiviral vector. n = 3 biologically independent samples each. h, Ratio of CD45.2+ to CD45.1+ in peripheral blood cells collected at the indicated time points after starting treatment with metformin or vehicle (Veh). For months 0-4, data are from 3 independent experiments and 21-24 mice per condition. For months 5-7, data are from one of the 3 experiments and 6-8 mice per condition. Exact n values are provided in the Source Data. Statistical significance was determined in comparison to the R878H/ + Veh group. In box plots in a-d, the box represents the interquartile range with the median indicated by the line inside the box; whiskers extend to the minimum and maximum values. In a, right, e-h, data are mean ± s.e.m. Statistical significance was calculated using two-sided (a-c,e-h) or one-sided (d) Student's t-tests. *P<0.05, **P<0.01, ***P<0.001 and****P<0.0001."
                ]
            },
            {
                "title": "Dependency on mitochondrial respiration",
                "content": "We postulated that the increased mitochondrial respiration in Dnmt3aR878H HSPCs is required for their competitive advantage over wild-type cells. To test this, we first established an in vitro competition assay in which CD45.2+ Dnmt3aR878H/+ and CD45.1+ Dnmt3a+/+ LK cells were mixed at a ratio of approximately 2:3 and cultured in cytokine-supplemented methylcellulose medium for around 10 days, followed by determination of the proportions of CD45.2* and CD45.1+ cells (Extended Data Fig. 1d and Supplementary Fig. 1a). A parallel competition assay between CD45.2+ Dnmt3a+/+ and CD45.1+ Dnmt3a+/+ LK cells mixed at the same starting ratio served as a control. After the culture period, the proportion of CD45.2+ Dnmt3aR878H/+ cells was consistently 20% to 30% higher than that of CD45.2+ Dnmt3a+/+ cells in the first passage and 40% to 50% higher in the second passage (Extended Data Fig. 1e), demonstrating the competitive advantage of the mutant cells. Using this assay, we studied the effect of genetic knockdown of mitochondrial electron transport chain (ETC) subunits on the competitive advantage of Dnmt3aR878H/+ HSPCs by transducing the mixed CD45.2+ mutant-CD45.1+ wild-type population with lentiviral vectors expressing short hairpin RNAs (shRNAs) targeting Ndufv1 and Cox15 (Extended Data Fig. 2a), which encode critical subunits in complex I and complex IV of the ETC, respectively. Downregulation of these genes reduced the basal OCR and competitive advantage of CD45.2+ Dnmt3aR878H/+ cells (Fig. 1d,e), indicating that mutant HSPCs are dependent on increased OXPHOS to outcompete their wild-type counterparts. To explore the translational relevance of this finding, we tested the effect of metformin-a commonly used oral anti-diabetic drug and pharmacologic inhibitor of complex I (Ref: 18)-on Dnmt3aR878H/+ LK HSPCs. Consistent with the genetic knockdown studies, treatment with metformin at a clinically relevant concentration (Ref: 18) (50 µM) suppressed the competitive advantage of mutant cells in vitro (Fig. 1f). This effect was rescued by expression of NDI1, a metformin-resistant yeast analogue of complex I (Ref: 19,20), thus confirming that the effect of metformin was due to on-target complex I inhibition (Fig. 1g). Metformin treatment also selectively reduced the clonogenic potential of Dnmt3aR878H/+ LK HSPCS over Dnmt3a+/+ LK HSPCs in standard colony-forming unit (CFU) assays (Extended Data Fig. 2b). To determine whether the effect of metformin was relevant in vivo and over a longer treatment period, we conducted a competitive repopulation experiment by mixing CD45.2+ Dnmt3aR878H/+ or Dnmt3a+/+ WBM cells with CD45.1+ Dnmt3a++ WBM cells at a 2:3 ratio and transplanting the mixed cells into lethally irradiated recipients (Extended Data Fig. 2c). Five weeks after transplantation, the recipient mice were either left untreated or started on treatment with metformin in their drinking water at 5 mg ml¯¹, a concentration that has previously been shown to result in blood concentrations similar to those achievable in humans (Ref: 21). Peripheral blood chimerism analysis showed a stable ratio of CD45.2+ to CD45.1+ cells in mice that received CD45.2 Dnmt3a+/+ control cells, and the ratio was not affected by metformin treatment (Fig. 1h and Supplementary Fig. 1b). By contrast, the ratio of CD45.2+ to CD45.1+ cells steadily increased over a 7-month period in mice that received CD45.2+ Dnmt3aR878H/+ cells, reflecting their competitive advantage over CD45.1+ wild-type cells (Fig. 1h). Notably, metformin decreased this competitive advantage up to 7 months (Fig. 1h). This effect was observed in both the myeloid and lymphoid compartments (Extended Data Fig. 2d and Supplementary Fig. 1b). Our findings collectively indicate that inhibition of mitochondrial respiration is a potential strategy for targeting DNMT3A R882 mutation-driven clonal haematopoiesis.",
                "figures": []
            },
            {
                "title": "Metformin suppresses Dnmt3aR878H/+ HSCS",
                "content": "Metformin suppressed the long-term competitive advantage of Dnmt3aR878H/+ donor cells in vivo (Fig. 1h), reflective of an effect at the HSC level. To provide independent evidence for an effect at the HSC level and gain insights into the mechanism of action of metformin, we performed scRNA-seq analysis on LK-enriched bone marrow cells from the untreated and metformin-treated recipients at the end of the 7-month treatment period (Fig. 1h). The cells were collected from the mice transplanted with CD45.2+ Dnmt3aR878H/+ and CD45.1+ Dnmt3a+/+ competitor cells and stained with antibody-oligonucleotide conjugates specific for CD45.2 or CD45.1 to identify their donor origin. A total of 22,407 cells from untreated control mice (n = 2) were sequenced, 84.6% of which were CD45.2+ Dnmt3aR878H/+ cells (Fig. 2a). For comparison, a total of 23,818 cells from metformin-treated mice (n = 2) were sequenced, and the proportion of CD45.2+ Dnmt3aR878H/+ cells was significantly less at 56.5% (P<0.0001by chi-square test) (Fig. 2a). To determine which HSPC subsets were affected, we annotated each cell on the basis of their correlation with reference mouse HSPC gene sets (Ref: 22) and identified 11 different haematopoietic subsets (Fig. 2a). Metformin treatment reduced the ratio of CD45.2+ to CD45.1+ cells in the HSC cluster as well as myeloid progenitor subsets (Fig. 2b,c), consistent with its effect at the HSC level. Flow cytometric analysis of bone marrow samples collected from mice after 4 months of treatment also showed a reduction in the ratio of CD45.2+ to CD45.1+ cells in immunophenotypically defined (Lin KIT+SCA-1+ CD150*CD48¯) HSCs and progenitor subsets (Extended Data Fig. 3a,b). To corroborate these findings, we transplanted Dnmt3aR878H/+ or Dnmt3a+/+ donor WBM cells from sex-matched littermates in a non-competitive manner into lethally irradiated recipients. Five weeks after transplantation, the recipients were either left untreated or started on treatment with metformin for 1 month (Extended Data Fig. 3c). In untreated mice, the number of immunophenotypic HSCs per femur and the proportion of HSCs in the Lin SCA-1+KIT+ (LSK) fraction were higher in Dnmt3aR878H/+ recipients compared with Dnmt3a+/+ recipients (Fig. 2d,e). The expansion of mutant HSCs was associated with a trend towards a higher proportion of HSCs in active cycling based on Ki-67 staining (Fig. 2f). Metformin treatment reduced all these parameters in Dnmt3aR878H/+ recipients to levels comparable to those in untreated Dnmt3a+/+ recipients (Fig. 2d-f). Our findings demonstrate that metformin treatment suppresses the competitive advantage of Dnmt3aR878H/+ HSCS.",
                "figures": [
                    "Fig. 2 | Metformin suppresses the competitive advantage of Dnmt3aR878H/+ HSCs. a, Top, dimensionality reduction using uniform manifold approximation and projection (UMAP) on all sequenced cells (n = 46,225 cells). Bottom, UMAP cell density plots of CD45.1+ Dnmt3a+/+ cells versus CD45.2+ Dnmt3aR878H/+ cells in LK-enriched bone marrow samples collected from mice treated with vehicle or metformin. B cell P, B cell progenitor; Ba, basophil progenitor; E/B, erythroid/ basophil progenitor; Eo, eosinophil progenitor; Ery, erythroid progenitor; IMPs, immature myeloid progenitors; MkP, megakaryocyte progenitor; Mono, monocyte progenitor; Neu, neutrophil/granulocyte progenitor; T cell P, T cell progenitor. b, Proportion of CD45.1+ Dnmt3a++ cells versus CD45.2+ Dnmt3aR878H/+ cells in each transcriptomically defined HSPC subset from untreated and metformin-treated LK samples. c, Sankey diagrams showing the absolute number of sequenced cells in each HSPC subset among CD45.1+ Dnmt3a+/+ versus CD45.2+ Dnmt3aR878H/+ fractions in LK-enriched bone marrow samples collected from mice treated with vehicle or metformin. d, Number of immunophenotypic HSCs (Lin KIT+SCA-1+CD150+CD48) in the femur from mice transplanted with WBM cells of the indicated genotype and treated with or without metformin. n = 5 biologically independent samples each. e, Proportion of immunophenotypic HSCs in the LSK fraction of samples from d. f, Proportion of immunophenotypic HSCs with positive or negative Ki-67 staining in samples from d. In box plots in d, e, the box represents the interquartile range with the median indicated by the line inside the box; whiskers extend to the minimum and maximum values. In f, data are mean ± s.e.m. Statistical significance was calculated using two-sided (d, f) or one-sided (e) Student's t-tests."
                ]
            },
            {
                "title": "Metformin increases methylation capacity",
                "content": "Gene set enrichment analysis (GSEA) of the scRNA-seq data revealed an enrichment of genes associated with OXPHOS in Dnmt3aR878H/+ HSCs relative to wild-type HSCs and a decrease in expression of these genes with metformin treatment (Extended Data Fig. 4a,b). This unexpected result suggested that metformin could influence mitochondrial respiration not only through a direct inhibition of complex I but also through downregulation of OXPHOS-related genes. To further investigate its mechanism of action, we first studied the effect of in vivo metformin treatment on mitochondrial function of HSPCs. We performed extracellular flux analysis on freshly isolated LK-enriched bone marrow cells from the mice that were untreated or treated with metformin for 1 month (Extended Data Fig. 3c). Metformin treatment reduced the basal and maximal OCRs as well as the Am of Dnmt3aR878H/+ LK cells to levels similar to those of untreated Dnmt3a+/+ LK cells (Extended Data Fig. 4c,d). To uncover the effect of metformin on specific metabolic pathways, we performed a mass spectrometry-based metabolomic analysis of the untreated and treated LK cells of both Dnmt3a genotypes. This analysis, which focused on metabolites that are central to energy and redox metabolism, detected 101 named metabolites, of which 8 were significantly increased in metformin-treated mutant LK cells compared with untreated mutant cells (Supplementary Table 1). Of note, 4 out of the 8 up-regulated metabolites (L-cysteate, dimethylglycine, reduced glutathione (GSH) and taurine) are involved in one-carbon (1C) metabolism through the methionine cycle (Fig. 3a,b). Since the methionine cycle generates SAM, these findings suggest that metformin could potentially affect SAM levels and the ratio of SAM to SAH, which is also known as the methylation index, an indicator of cellular methylation potential. To test this hypothesis, we directly measured the intracellular concentrations of SAM and SAH, which were below the detection threshold of the bulk metabolomic analysis. Consistent with our hypothesis, the methylation index was higher in metformin-treated Dnmt3aR878H/+ LK cells than in untreated cells (Fig. 3c), indicative of an increase in their cellular methylation potential. The effect of metformin on methylation index was observed only in Dnmt3aR878H/+ LK HSPCs and not in Dnmt3a+/+ LK cells (Fig. 3c). To determine whether the metformin-induced changes in methylation index could be due to alterations in the expression of genes involved in 1C metabolism, we performed bulk RNA-seq analysis of Dnmt3a+/+ and Dnmt3aR878H/+ LK-enriched cells that were untreated or treated with metformin for 1 month (Extended Data Fig. 3c). GSEA of the RNA-seq dataset showed that metformin treatment decreased the expression of genes associated with stemness and OXPHOS (Extended Data Fig. 4e,f), consistent with our earlier results. Notably, it also revealed a significant enrichment of genes involved in 1C metabolism in metformin-treated Dnmt3aR878H/+ LK cells (Fig. 3d). To confirm these findings, we performed quantitative PCR with reverse transcription (RT-qPCR) to measure the expression of eight genes that encode enzymes in the folate and methionine cycles (Shmt2, Mthfd2l, Shmt1, Mthfd1, Mthfr, Ahcy, Cbs and Bhmt) and found that metformin treatment increased their expression in Dnmt3aR878H/+LK cells (Fig. 3e). Although metformin also up-regulated expression of these genes in Dnmt3a+/+ LK cells, the magnitude of change was much smaller (Fig. 3e). These findings suggest that metformin selectively increases the cellular methylation potential of mutant HSPCs by upregulating the expression of genes involved in 1C metabolism. On the basis of the above findings, we hypothesized that metformin suppresses the competitive advantage of Dnmt3aR878H/+ cells by increasing their cellular methylation potential. To test this hypothesis, we investigated the effect of exogenous SAM and SAH on the competitive advantage of mutant LK cells using our in vitro assay (Extended Data Fig. 1d). The addition of exogenous SAM, which increases the methylation index, was sufficient to reduce the competitive advantage of Dnmt3aR878H/+ HSPCs (Extended Data Fig. 5a). The suppressive effect of SAM on Dnmt3aR878H/+ HSPCs was maintained after downregulation of Dnmt3b expression (Extended Data Fig. 5b,c), suggesting that this effect was independent of DNMT3B activity. Increasing the concentration of folic acid in the culture medium, which augments the availability of 1C units for SAM synthesis, also reduced the competitive advantage of Dnmt3aR878H/+ HSPCs (Extended Data Fig. 5d). Conversely, exogenous SAH, which lowers the methylation index, counteracted the suppressive effect of metformin on mutant cells (Extended Data Fig. 5a). To confirm these findings, we inhibited SHMT2 and MAT2A as alternative approaches to lowering the [SAM]/[SAH] ratio. SHMT2 generates a 1C unit (5,10-methylenetetrahydrofolate) that is necessary for SAM synthesis through the folate and methionine cycles, and MAT2A directly catalyses the synthesis of SAM from methionine (Fig. 3a). In line with our hypothesis, pharmacologic inhibition of SHMT with SHIN-1 (Ref: 23) or MAT2A with AG-270 (Ref: 24) rescued the suppressive effect of metformin on mutant HSPCS (Extended Data Fig. 5e, f). The addition of exogenous SAM mitigated the rescue effect of SHIN-1 (Extended Data Fig. 5g), indicating that SHIN-1 acts by reducing SAM production. Genetic knockdown of Shmt2 expression also rendered Dnmt3aR878H/+ HSPCs resistant to the suppressive effect of metformin (Extended Data Fig. 5h,i). Together, these findings support a mechanism in which metformin selectively reduces the competitive advantage of Dnmt3aR878H/+ HSPCs by increasing their cellular methylation potential.",
                "figures": [
                    "Fig. 3 | Metformin suppresses the competitive advantage of Dnmt3aR878H/+ HSPCs by enhancing their methylation potential. a, Schematic of the metabolic pathways involved in 1C metabolism. B12, vitamin B12; DMG, dimethylglycine; me, methyl; mTHF, methyltetrahydrofolate; THF, tetrahydrofolate. Created in BioRender. Chan, S. (2025) https://BioRender. com/a57k225. b, Quantification of the indicated metabolites in LK cells isolated from mice transplanted with bone marrow cells of the indicated genotype. The mice were either left untreated or treated with metformin for 1 month. n = 3 biologically independent samples per condition. c, Levels of SAM and SAH and the SAM:SAH ratio in LK cells isolated from mice transplanted with bone marrow cells of the indicated genotype. The mice were either left untreated or treated with metformin for 1 month. n = 12 biologically independent samples for each condition. d, Gene set enrichment plot of bulk RNA-seq data comparing metformin-treated Dnmt3aR878H/+ LK cells (n = 3 biologically independent samples) versus vehicle-treated Dnmt3aR878H/+ LK cells (n = 3 biologically independent samples) using the indicated gene set (WP435). ES, enrichment score. e, Expression level of the indicated genes by RT-qPCR in LK cells isolated from mice transplanted with bone marrow cells of the indicated genotype. The mice were either left untreated or treated with metformin for 1 month. n = 3 biologically independent samples for each condition. In b, c, e, the box represents the interquartile range with the median indicated by the line inside the box; whiskers extend to the minimum and maximum values. Statistical significance was calculated using two-sided Student's t-tests."
                ]
            },
            {
                "title": "Reversal of aberrant epigenetic profiles",
                "content": "The mechanism by which DNMT3A mutations confer a competitive advantage to mutant HSCs is believed to be mediated through focal DNA hypomethylation secondary to reduced de novo DNA methylation activity (Ref: 13,17). In the context of DNMT3A R882 mutants in which a copy of the wild-type gene remains, the residual DNA methylation activity is estimated to be around 20% of normal, but is not absent (Ref: 13). We hypothesized that the metformin-induced increase in methylation index could augment this activity, resulting in a reversal of the aberrant DNA CpG hypomethylation pattern in mutant cells and consequent decrease in their competitive advantage. A prediction based on this hypothesis is that elimination of residual DNMT3A activity by inactivating the remaining wild-type Dnmt3a allele in mutant cells should render them resistant to the effect of metformin. To test this prediction, we used CRISPR-Cas9 to knock out Dnmt3a in Dnmt3a+/+ and Dnmt3aR878H/+ LK cells. The knockout efficiency was approximately 98%, indicative of biallelic inactivation in both cell types (Extended Data Fig. 6a). Using our in vitro competition assay, we found that Dnmt3a knockout significantly increased the competitive advantage of LK HSPCs, regardless of their initial Dnmt3a genotype (Extended Data Fig. 6b). Metformin did not suppress the competitive advantage of Dnmt3aR878H/+ cells following Dnmt3a knockout, supporting the idea that residual DNMT3A activity is required for the metformin effect (Extended Data Fig. 6b). Another prediction is that metformin treatment should increase the level of methylation at CpG sites that are differentially hypomethylated in Dnmt3aR878H/+ cells. To test this, we performed reduced representation bisulfite sequencing (RRBS) analysis of LK-enriched bone marrow cells from recipient mice that received Dnmt3aR878H/+ or Dnmt3a+/+ WBM cells from sex-matched littermate donors and were either untreated or treated with metformin for 1 month (Extended Data Fig. 3c). The RRBS technique, which enriches for CpG-rich regions, was chosen because DNMT3A preferentially catalyses DNA methylation at CpG dinucleotides. We identified 5,430 DMRs in the comparison between untreated Dnmt3aR878H/+ (n = 4) and untreated Dnmt3a+/+ (n = 3) samples. Consistent with prior reports (Ref: 13,17), the majority of the DMRs (n = 4,649; 85.6%) were hypomethylated in the untreated Dnmt3aR878H/+ samples (Fig. 4a). In the comparison between metformin-treated Dnmt3aR878H/+ (n = 3) and untreated Dnmt3aR878H/+ (n = 4) samples, we identified 3,285 DMRs, 1,923 (58.5%) of which were hypermethylated in the treated samples (Fig. 4a). We found 870 overlapping DMRs at the intersection between these two sets (Extended Data Fig. 6c). In line with our hypothesis, metformin treatment increased the methylation level at 617 (90.9%) of the 679 hypomethylated DMRs in Dnmt3aR878H/+ samples, bringing their average methylation levels close to those of untreated Dnmt3a+/+ samples (Fig. 4b and Extended Data Fig. 6d). Similar findings were observed in the subsets of DMRs associated with CpG islands and gene promoter regions (Fig. 4a, b and Extended Data Fig. 6c,d). To explore the potential effect of these changes in DNA methylation on gene expression, we conducted GSEA on genes ranked by differential promoter methylation and mRNA expression from our bulk RNA-seq analysis. This analysis revealed that Dnmt3aR878H/+ cells, compared with Dnmt3a+/+ cells, exhibited decreased promoter methylation and increased expression of genes involved in mitochondrial respiration (Extended Data Fig. 7a). Re-analysis of a previously published combined transcriptome and methylome dataset of single progenitor cells from individuals with DNMT3A R882-mutated clonal haematopoiesis also revealed similar patterns in changes in the methylation and expression of genes associated with OXPHOS (Ref: 17) (Extended Data Fig. 7b). Analysis of our bulk RRBS and RNA-seq datasets also showed promoter hypermethylation and decreased expression of genes associated with 1C metabolism in Dnmt3aR878H/+ cells relative to Dnmt3a+/+ cells (Extended Data Fig. 7a). Notably, metformin treatment reversed these aberrant changes in DNA methylation and gene expression in mutant cells (Extended Data Fig. 7a). In human clonal haematopoiesis, the DNMT3A R882 mutation has previously been reported to result in preferential DNA hypomethylation of targets of the polycomb repressive complex 2 (PRC2) (Ref: 17), which catalyses the methylation of histone H3 K27 (H3K27). In addition, the Dnmt3aR878H mutation was previously found to be associated with a reduction in H3K27 trimethylation (H3K27me3) (Ref: 25), indicating its potential influence on another layer of epigenetic regulation. Given that PRC2-mediated methylation activity is also regulated by the [SAM]/[SAH] ratio, we hypothesized that metformin could reverse the aberrant H3K27 hypomethylation profile in Dnmt3aR878H/+ HSPCs. To test this, we performed H3K27me3 chromatin immunoprecipitation followed by sequencing (ChIP-seq) analysis of Dnmt3aR878H/+ and Dnmt3a+/+ LK-enriched bone marrow cells from the mice that were either untreated or treated with metformin for 1 month (Extended Data Fig. 3c). This analysis revealed a reduction in H3K27me3 levels globally and in the regions surrounding transcription start sites (TSSs) in the untreated Dnmt3aR878H/+ samples relative to the untreated Dnmt3a+/+ samples (Fig. 4c,d). Consistent with our hypothesis, metformin treatment restored H3K27me3 levels in Dnmt3aR878H/+ samples to a level resembling that of untreated Dnmt3a+/+ samples (Fig. 4c,d). To confirm these findings using an orthogonal approach, we measured the amount of H3K27me3 by intracellular flow cytometry. Similar to the ChIP-seq results, we found that Dnmt3aR878H/+ LK cells had lower levels of H3K27me3 than Dnmt3a+/+ LK cells and metformin treatment restored H3K27me3 levels in mutant cells to levels resembling those of wild-type cells (Fig. 4e). Together, the above findings demonstrate that metformin treatment can reverse the aberrant epigenetic landscape in Dnmt3aR878H/+ HSPCs.",
                "figures": [
                    "Fig. 4 | Metformin reverses the aberrant epigenetic profiles in Dnmt3aR878H/+ HSPCs. a, Violin plots of the difference in beta values at all DMRs, CpG island-associated DMRs or promoter-associated DMRs in the comparison between untreated Dnmt3aR878H/+ LK samples versus untreated Dnmt3a+/+ LK samples and between metformin-treated Dnmt3aR878H/+ LK samples versus untreated Dnmt3aR878H/+ LK samples. n = 3 biologically independent samples for untreated Dnmt3a+/+ and metformin-treated Dnmt3aR878H/+. n = 4 biologically independent samples for metformin-treated Dnmt3a+/+ and untreated Dnmt3aR878H/+ samples. Pvalues are calculated using the two-tailed one-sample Wilcoxon signed-rank test to determine whether the median was significantly different from O. Pos, positive change in methylation state; Neg, negative change in methylation state. b, Plot showing the change in beta values at overlapping DMRs between metformin-treated Dnmt3aR878H/+ samples versus untreated Dnmt3aR878H/+ samples on the x axis and between untreated Dnmt3aR878H/+ samples versus untreated Dnmt3a++ samples on the reverse y axis. c, Peak values from H3K27me3 ChIP-seq analysis of LK HSPC samples collected from mice transplanted with bone marrow cells of the indicated genotype and treated with or without metformin. The box represents the 10th-90th percentile range with the median indicated by the line inside the box and whiskers extend to the minimum and maximum values. Statistical significance was calculated using the Mann-Whitney test. d, Distribution of H3K27me3 signals surrounding (±2 kb) the TSS regions with the strongest signals (n = 10,622) in the indicated samples. Darker blue indicates higher read densities, while red corresponds to lower read densities. e, Intracellular H3K27me3 staining of LK HSPCs collected from mice transplanted with bone marrow cells of the indicated genotype and treated with or without metformin. n = 5 biologically independent samples for each condition. The box represents the interquartile range with the median indicated by the line inside the box; whiskers extend to the minimum and maximum values. Statistical significance was calculated using two-sided Student's t-tests."
                ]
            },
            {
                "title": "Metformin suppresses human mutant HSPCs",
                "content": "To explore the relevance of our findings in human clonal haematopoiesis, we modelled the DNMT3A R882 mutation in human HSPCs by transducing purified CD34+ HSPCs from cord blood with lentiviral vectors expressing a DNMT3A shRNA and BFP. Since DNMT3A R882-mutated cells retain about 20% of wild-type DNMT3A activity (Ref: 13), knockdown of DNMT3A expression should phenocopy the effects of DNMT3A R882 mutations. Using this approach and an in vitro competition assay with human cytokines (Fig. 5a and Supplementary Fig. 1c), we found that DNMT3A-knockdown (DNMT3A-KD) HSPCs displayed a competitive advantage over control HSPCs expressing a non-targeting shRNA (shNT) (Fig. 5b and Extended Data Fig. 8a,b). Consistent with our mouse studies, metformin treatment reduced the competitive advantage of DNMT3A-KD HSPCs (Fig. 5b). The effects of DNMT3A knockdown and metformin treatment were observed in both the CD34+ and CD34-cell fractions following ex vivo culture (Extended Data Fig. 8c). The suppressive effect of metformin was mitigated by the co-expression of NDI1 (Fig. 5b), indicating that the effect was mediated through inhibition of complex I. DNMT3A-KD HSPCs exhibited higher basal OCRs compared with control HSPCs, a difference that was eliminated by metformin treatment (Fig. 5c). Similar to mouse Dnmt3aR878H HSPCs, the levels of 5mCand H3K27me3 were lower in DNMT3A-KD cells than in control cells (Fig. 5d,e). Metformin treatment augmented the methylation index (Fig. 5f and Extended Data Fig. 8d) and increased 5mC and H3K27me3 in DNMT3A-KD cells (Fig. 5d,e), mirroring the mechanistic findings observed in mouse Dnmt3aR878H HSPCs. To further evaluate the effect of metformin on DNMT3A R882-mutated human HSPCs, we designed and optimized a prime editing strategy to introduce the R882H mutation into the DNMT3A gene in purified CD34+ HSPCs from cord blood samples. The Cas nickase (nCas)-based prime editing technique has been shown to cause less cytotoxic and genotoxic stress and edit with higher precision and efficiency in long-term repopulating HSPCs than conventional homology-directed repair-based CRISPR-Cas9 editing strategies (Ref: 26). Using the optimized prime editing strategy, we introduced the DNMT3AR882H mutation in five HSPC samples from independent donors. As a negative control, we introduced a T>G single nucleotide variant in exon 1 of the B2M gene that causes a premature stop codon (Ref: 26). After prime editing, the baseline (day 0) mean variant allele frequency (VAF) was 20% for DNMT3AR882H (Fig. 5g and Extended Data Fig. 8e) and 49.8% for the B2M single nucleotide variant (Fig. 5h). The edited cell pools were plated in methylcellulose medium to assess the relative competitive advantage of the DNMT3AR882H versus DNMT3A wild-type cells. After an additional 14 days in culture, the mean VAF of DNMT3A R882H increased to 42.4% in untreated cells, consistent with a relative expansion of the mutant population (Fig.5g). Metformin treatment suppressed the expansion of DNMT3A-mutated cells with a mean VAF of 26.2% (Fig. 5g). By contrast, the mean VAFs of B2M-edited cells did not significantly change after 14 days in culture with or without metformin treatment (Fig. 5h), indicating that the observed effects on DNMT3AR882H HSPCs were not an artefact of prime editing. Together, these results support the idea that metformin has the potential to suppress the competitive advantage of DNMT3A R882-mutated clones in human clonal haematopoiesis.",
                "figures": [
                    "Fig. 5 | Metformin suppresses human DNMT3AR882H HSPCs. a, Schematic diagram of the in vitro competition assay of human CD34+-enriched HSPCs. Created in BioRender. Chan, S. (2025) https://BioRender.com/w95m335. b, Proportion of BFP+ and GFP+ cells in a competition assay between BFP+ HSPCS expressing shNT, shRNA targeting DNMT3A (shDNMT3A) alone or shDNMT3A plus NDI1 and GFP+ HSPCs expressing shNT in the absence or presence of metformin. n = 4 biologically independent samples each. c, Basal OCR in human HSPCs expressing shNT or shDNMT3A and treated with or without metformin. n = 4 biologically independent samples each. d, Intracellular 5mC staining in human HSPCs expressing the indicated shRNA and treated with or without metformin. n = 3 biologically independent samples each. e, Intracellular H3K27me3 staining in human HSPCs expressing the indicated shRNA and treated with or without metformin. n = 4 biologically independent samples each. f, SAM:SAH ratio in human HSPCs expressing the indicated shRNA and treated with or without metformin. n = 3 biologically independent samples each. g, DNMT3AR882H VAFs of prime-edited human HSPCs at baseline (day 0) and after 14 days in culture in the presence or absence of metformin. n = 5 biologically independent samples. h, Mutant B2M VAFs of prime-edited human HSPCs at baseline (day 0) and after 14 days in culture in the presence or absence of metformin. n = 4 biologically independent samples. Lines connect VAFs from the same sample in g, h. In c-f, the box represents the interquartile range with the median indicated by the line inside the box; whiskers extend to the minimum and maximum values. In b, data are mean ± s.e.m. In g, h, the bar plot represents the mean. Statistical significance was calculated using two-sided unpaired (b-f) or paired (g,h) Student's t-tests."
                ]
            }
        ]
    },
    "discussion": "Targeting the cell-intrinsic mechanisms that are critical for the selective advantage of mutant HSPCs in clonal haematopoiesis is a potential strategy for suppressing clonal expansion and lowering the risk of developing disease related to clonal haematopoiesis. Here we found that upregulation of mitochondrial respiration is a key functional consequence of the Dnmt3a R878H mutation and mutant HSPCs are dependent on this metabolic reprogramming to outcompete their wild-type counterparts. Notably, this dependency was evident at the level of HSCs. Thus, our findings provide evidence that mitochondrial metabolism is a critical cell-intrinsic regulator of the clonal advantage of DNMT3A R882-mutated clones in clonal haematopoiesis. This notion is consistent with the growing body of evidence that demonstrates a role for mitochondrial bioenergetics and dynamics in the regulation of stem cell fate. Our finding that Dnmt3aR878H/+ HSPCs are dependent on increased mitochondrial respiration has important therapeutic implications because many components of the ETC are druggable cellular targets. In this study, we focused on the therapeutic potential of metformin, a biguanide that is widely used in the treatment of diabetes. Although biguanides have been reported to target many cellular proteins, their inhibitory effect on complex I (NADH dehydrogenase) activity is the most well established and supported by structural evidences. Indeed, our finding that ectopic expression of NDI1, a metformin-resistant yeast analogue of complex I, rendered Dnmt3aR878H/+ HSPCs insensitive to effects of metformin strongly supports complex I as the main protein target. However, the observed reduction in mitochondrial respiration in metformin-treated Dnmt3aR878H/+ HSPCs was not due to complex I inhibition alone but also occurred through the downstream downregulation of genes involved in OXPHOS. Results from our multi-omics studies suggest that metformin exerts its downstream effects on gene expression, at least in part, by increasing the methylation potential and consequently augmenting the activity of DNMT3A, the PRC2 complex and possibly other SAM-dependent methyltransferases in Dnmt3aR878H/+ HSPCs. This proposed mechanism is consistent with prior studies that demonstrate an association between metformin exposure and an increase in 5mC and H3K27me3 levels in various cellular contexts (Ref: 27-29). It is noteworthy that metformin appears to preferentially increase the expression of genes involved in 1C metabolism and methylation index in Dnmt3aR878H/+ HSPCs over wild-type cells, indicating a degree of selectivity in its effects. Whether this selectivity is specific for metformin or common across other ETC inhibitors is unclear and warrants further investigations. To explore the translational relevance of our findings, we utilized two distinct approaches to model the DNMT3A R882 mutation in human cells. In the first approach, we down-regulated DNMT3A expression using RNA interference to mimic the functional effect of the DNMT3A R882 mutation, which has been shown to reduce DNMT3A enzymatic activity to around 20% that of the wild type (Ref: 13). Metformin treatment effectively suppressed the competitive advantage of these DNMT3A-KD HSPCs, aligning with our proposed mechanistic model in which metformin acts by augmenting the residual DNMT3A activity in the cell. In the second approach, we optimized a prime editing strategy to introduce the DNMT3AR882H mutation into human HSPCs with high editing efficiencies. The prime editing technique has important advantages over Cas9 nuclease-based genome editing strategies that depend on the generation of DNA double-strand breaks, which are highly toxic to HSCs. Although prime editing can still induce a small amount of double-strand breaks, it is less genotoxic and can achieve high editing efficiencies in long-term repopulating HSPCs (Ref: 26). Our reported methodology represents an important technical resource for the study of DNMT3A R882 mutations in human HSPCs. The presence of clonal haematopoiesis has been shown to be associated with an increased risk of developing not only haematologic malignancies but also a growing list of age-related inflammatory illnesses. Interventions that effectively lower the risk of these adverse outcomes in clonal haematopoiesis carriers have the potential to positively affect the health of a large segment of the aging population. However, this goal is not yet possible owing to the lack of known interventions that effectively suppress the expansion of mutant clones in clonal haematopoiesis. The ideal preventive intervention should be not only effective, but also easy to administer and safe for long-term use. Metformin fulfils these criteria and can be readily repurposed as a preventive treatment for DNMT3A R882-mutated clonal haematopoiesis carriers, especially those at high risk of malignant transformation or other clonal haematopoiesis-related illness. A recent retrospective case-control study bolsters this concept, revealing that metformin use correlated with a decreased risk of myeloproliferative neoplasm development (Ref: 30). Alternative interventions that augment the availability of 1C metabolites for SAM production, such as folic acid, may also be effective in suppressing the competitive advantage of DNMT3A R882-mutated clones. Our research provides the preclinical rationale for investigating these approaches in future clinical trials."
}